### Class: July 04: Adv Python

In [1]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

In [30]:
import pandas as pd
import numpy as np

In [9]:
df = pd.read_csv(url)
df.shape

(1313, 6)

In [10]:
# checking the df out!

df.tail()

                        Name PClass   Age   Sex  Survived  SexCode
1308      Zakarian, Mr Artun    3rd  27.0  male         0        0
1309  Zakarian, Mr Maprieder    3rd  26.0  male         0        0
1310        Zenni, Mr Philip    3rd  22.0  male         0        0
1311        Lievens, Mr Rene    3rd  24.0  male         0        0
1312          Zimmerman, Leo    3rd  29.0  male         0        0

## Conditional Query on DF

In [14]:
onlyFemaleDf = df[df['Sex'] == 'female']
'Total female rows:', len(onlyFemaleDf)

('Total female rows:', 462)

In [18]:
# multiple conditions using logical operators like &, |


# condition 1: only female above 65 years of age
condDf = df[(df['Sex'] == 'female') | (df['Age']>=65)]
condDf.shape
condDf

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
...,...,...,...,...,...,...
1283,"Vestrom, Miss Hulda Amanda Adolfina",3rd,14.0,female,0,1
1293,"Wilkes, Mrs Ellen",3rd,45.0,female,1,1
1304,"Yasbeck, Mrs Antoni",3rd,15.0,female,1,1
1306,"Zabour, Miss Hileni",3rd,NaN,female,0,1
1307,"Zabour, Miss Tamini",3rd,NaN,female,0,1

In [22]:
# using replace 

df['Sex'].replace(['female','male'], ['Woman', 'Man']).head(5)

# you can use inplace = True parameter in the replace() method to persist the changes

0    Woman
1    Woman
2      Man
3    Woman
4      Man
Name: Sex, dtype: object

In [23]:
df['Sex'] 
# no change in the dataframe

0       female
1       female
2         male
3       female
4         male
         ...
1308      male
1309      male
1310      male
1311      male
1312      male
Name: Sex, Length: 1313, dtype: object

In [25]:
# usage of `map` instead of `replace`

df['Sex'].map({'female': 'Woman', 'male': 'Man'})

0       Woman
1       Woman
2         Man
3       Woman
4         Man
        ...
1308      Man
1309      Man
1310      Man
1311      Man
1312      Man
Name: Sex, Length: 1313, dtype: object

### Rename column names (temporary)

In [27]:
df.rename(columns = {'PClass':'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [28]:
# using isnull() to find missing values

df[df['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [31]:
# replacing missing null values:

df['Sex'].replace('male', np.nan)

0       female
1       female
2          NaN
3       female
4          NaN
         ...
1308       NaN
1309       NaN
1310       NaN
1311       NaN
1312       NaN
Name: Sex, Length: 1313, dtype: object

In [32]:
# drop a column or row
# axis = 1 for cols
# axis = 0 for rows

df.drop('Age', axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [36]:
# subset

df[df['Sex'] != 'male' ]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
...,...,...,...,...,...,...
1283,"Vestrom, Miss Hulda Amanda Adolfina",3rd,14.0,female,0,1
1293,"Wilkes, Mrs Ellen",3rd,45.0,female,1,1
1304,"Yasbeck, Mrs Antoni",3rd,15.0,female,1,1
1306,"Zabour, Miss Hileni",3rd,NaN,female,0,1
1307,"Zabour, Miss Tamini",3rd,NaN,female,0,1

In [37]:
# Unique values:

df['Sex'].unique()

array(['female', 'male'], dtype=object)

In [38]:
# value counts to get count of each unique values

df['Sex'].value_counts()

Sex
male      851
female    462
Name: count, dtype: int64

In [42]:
# value counts to get count of each unique values, including na

df['Age'].value_counts(dropna=False)

Age
NaN      557
22.00     35
21.00     31
30.00     31
18.00     30
        ...
0.80       1
67.00      1
0.33       1
0.17       1
69.00      1
Name: count, Length: 76, dtype: int64

In [50]:
## groupby

df[['Sex','Age','Survived']].groupby('Sex').mean()

              Age  Survived
Sex
female  29.396424  0.666667
male    31.014338  0.166863

In [52]:
df.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [53]:
# looping in df

for name in df['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [54]:
# shorthand method - although it gives out an array

[name.upper() for name in df['Name'][:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

## Apply a function on a column

In [56]:
# define a function

def uppercase(x):
    return x.upper()

In [57]:
df['upName'] = df['Name'].apply(uppercase)
df.head()

,Name,PClass,Age,Sex,Survived,SexCode,upName
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1,"ALLEN, MISS ELISABETH WALTON"
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1,"ALLISON, MISS HELEN LORAINE"
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0,"ALLISON, MR HUDSON JOSHUA CREIGHTON"
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1,"ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)"
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0,"ALLISON, MASTER HUDSON TREVOR"

## Concatenating

In [60]:
data_a = {'id' : ['1','2','3'],
         'first': ['Bob','Alice','Spiderman'],
         'last':['Stake','Man','Mr']}

df_a = pd.DataFrame(data_a, columns = ['id','first','last'])
df_a

  id      first   last
0  1        Bob  Stake
1  2      Alice    Man
2  3  Spiderman     Mr

In [61]:
data_b = {'id' : ['4','5','6'],
         'first': ['Cho','Hacker','Zuck'],
         'last':['Ming','Man','Puck']}

df_b = pd.DataFrame(data_b, columns = ['id','first','last'])
df_b

  id   first  last
0  4     Cho  Ming
1  5  Hacker   Man
2  6    Zuck  Puck

In [63]:
df_c = pd.concat([df_a, df_b], axis=0)
df_c

  id      first   last
0  1        Bob  Stake
1  2      Alice    Man
2  3  Spiderman     Mr
0  4        Cho   Ming
1  5     Hacker    Man
2  6       Zuck   Puck

In [64]:
df_cax1 = pd.concat([df_a, df_b], axis=1)
df_cax1

  id      first   last id   first  last
0  1        Bob  Stake  4     Cho  Ming
1  2      Alice    Man  5  Hacker   Man
2  3  Spiderman     Mr  6    Zuck  Puck

## Merging/Joining Table

In [66]:
emp_data  = {'emp_id': ['1','2','3','4'],
            'name':['Sarah Connor','Barry Allen','Jacob Miz','Tim Tim']}

df_emp = pd.DataFrame(emp_data, columns = ['emp_id','name'])
df_emp

  emp_id          name
0      1  Sarah Connor
1      2   Barry Allen
2      3     Jacob Miz
3      4       Tim Tim

In [69]:
sales_dat = {'emp_id':['3','4','5','6'],
            'total_sales':[23456, 5134, 6454, 4758]}

df_sales = pd.DataFrame(sales_dat, columns = ['emp_id','total_sales'])
df_sales

  emp_id  total_sales
0      3        23456
1      4         5134
2      5         6454
3      6         4758

In [71]:
# LEFT MERGE/JOIN

df_merge = pd.merge(df_emp, df_sales, on='emp_id', how='left')
df_merge

  emp_id          name  total_sales
0      1  Sarah Connor          NaN
1      2   Barry Allen          NaN
2      3     Jacob Miz      23456.0
3      4       Tim Tim       5134.0

In [73]:
# OUTER MERGE/JOIN

df_merge = pd.merge(df_emp, df_sales, on='emp_id', how='outer')
df_merge

  emp_id          name  total_sales
0      1  Sarah Connor          NaN
1      2   Barry Allen          NaN
2      3     Jacob Miz      23456.0
3      4       Tim Tim       5134.0
4      5           NaN       6454.0
5      6           NaN       4758.0

### Tip: If common id name of column is different on the tables, use left_on='col_name', right_on='col_name'